# erlang_examples

factorial.erl:

1> c(factorial).

{ok,factorial}

2> factorial:my_fac(100).

93326215443944152681699238856266700490715968264381621468592963895217599993229915608941463976156518286253697920827223758251185210916864000000000000000000000000


formatter.erl:

1> c(formatter).

{ok,formatter}

2> formatter:my_bitstr(<<"1,4,3,2,7,8,9,12,15,13,14">>).

<<"1-4,7-9,12-15">>
